Revit 2027 API
CreateRelatedFileProgressChangedEventArgs.DownloadFinished Property
 Indicates if all data downloads are finished.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DownloadFinished { get; }
Public ReadOnly Property DownloadFinished As Boolean
	Get
public:
property bool DownloadFinished {
	bool get ();
}
member DownloadFinished : bool with get
Property Value
Boolean
See Also
Reference
CreateRelatedFileProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace